УчетВУправляющихДляГит1/src/Enums/СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС/СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС</name>
  <enumValues>
    <name>Объединить</name>
  </enumValues>
  <enumValues>
    <name>Присоединить</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ПреобразоватьЗначение(Значение) Экспорт

	Если Значение = "ATTACH" Тогда
		Возврат Перечисления.СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС.Присоединить;
	ИначеЕсли Значение = "MERGE" Тогда
		Возврат Перечисления.СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС.Объединить;
		
	ИначеЕсли Значение = Перечисления.СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС.Присоединить Тогда
		Возврат "ATTACH";
	ИначеЕсли Значение = Перечисления.СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС.Объединить Тогда
		Возврат "MERGE";
	КонецЕсли; 

КонецФункции

#КонецОбласти

#КонецЕсли
